tech_notes/000_PROJECTS.org
# Time-stamp: <Last changed 2026-01-20 16:12:32 by jim>


* Projects - TODO                                                   :todo:
* Org Notes
( ^c-[ ) Add to Agenda List

*bold*
_underline_
/italilc/
+strike-through+
H_2O
\exists
~print('hi')~

--- https:://www.nytimes.com --- \
[ [nytimes.com] [https://www.nytimes.com]]

links:
[[*Legacy ??][This file]]
[[file:281_emacs_notes.typ][281_emacs_cheat]]

#+begin_quote
Type <q <TAB> to insert quote block
#+end_quote

* TODO Learn Org mode                                                  :org:learn:

Goal: START organizing projects; NEXT TODO for each;  replacing paper.
Second step:  Org mode vs denote vs ?  
TODO: set org-agenda-files to collect ALL TODOs. 
[ [org-mode ] [https://www.youtube.com/watch?v=0-brF21ShRk&list=PLknodeJt-I5GJmcd7ENakYf_M0x9q50d1&index=8]] Galvin
- [ [tutorial][https://emacsclub.github.io/html/org_tutorial.html] ]
- [ [another tutorial][https://orgmode.org/worg/org-tutorials/orgtutorial_dto.html] ]

* Learn Help Files
* elisp
** TODO Prot's book :read:
** TODO Chicago book :read:

* Prot's text:*   repo: M-x Dired | M-x dired-do-info (over file: elispelem.info) 

* Learn: Denote :emacs:learn:
* Algebra, Math, Statistics
** good, basic review geomrtry + transformations: https://pages.mtu.edu/~shene/COURSES/cs3621/NOTES/  :read:

** Linear Maps & Derivatives (https://math-website.pages.dev/, "CantorClosure:  https://www.reddit.com/r/learnmath/comments/1pjl731/differential_calculus_through_linear_maps/)
** Read Shaina Race :read:
- write simple Baysian example :statistics:
- write ellipse transformation to cononical coordinates. :math:
- Calculus:  polar coordnates (r, theta),  r can be negative! :math:
- Ng videos:  unsurprised (find patterns) [https://learn.deeplearning.ai/specializations/machine-learning/lesson/a7qh0/unsupervised-learning-part-2 [Andrwe Ng]

* Shiny
TODO Examples:  UI/modules
TODO March '25 pharma
TODO Teal Gallery

* Git
** TODO Git In Practice :read:
HEAD, change Branch, vs TIP
MERGE
SQUASH

* i3
* ML/AI/LLMs/...
** TODO Mnielson [ [neural][ http://neuralnetworksanddeeplearning.com/chap1.html]] :read:
** TODO Clark models               :read: 
** Kim, S.... https://skim.math.msstate.edu/LectureNotes/Machine_Learning_Lecture.pdf (python, looks educational!) :read:
** TODO Patterns Hardt & Recht :read:

* Typst

  USE online typst editor to debug  :typst
  Basic:  000_simple.typ (learning curve to get symbols and format right).
  Math:  done- simple matrix  notation

* R
- typst:  Ch 1,2 my Advanced R notes
* Next Phone
** TODO Pixel 3a XT?                                               :shopping:
  
* Legacy Code 
* pyTorch
** https://www.learnpytorch.io/02_pytorch_classification/              :read:



#+BEGIN_CENTER
hi
#+END_CENTER


<2024-05-04 Sat>:

## REST RESTful, HTTP Protocol , JSON, RFC, API and Web Technologies

#+BEGIN_SRC bash
  git status
#+END_SRC





** Kim, S. Math Foundations https://skim.math.msstate.edu/LectureNotes/Machine_Learning_Lecture.pdf :read:
** Mohamed AAZI - good, but lost the lin  :read:
** ML from scratch, python, plus details:  https://github.com/rodmarkun/SmolML?tab=readme-ov-file :read:
** video:  freeCodeCamp pyTorch  :read:
** Geeks4Geeks : scikit  :read:
