tech_notes/000_PROJECTS.tex
% Created 2026-01-22 Thu 21:03
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{jim}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={jim},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.1 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Projects - TODO\hfill{}\textsc{todo}}
\label{sec:org167653e}
\section{Org Notes}
\label{sec:org9119538}
( \^{}c-[ ) Add to Agenda List

\textbf{bold}
\uline{underline}
\emph{italilc}
\sout{strike-through}
H\textsubscript{2O}
\(\exists\)
\texttt{print('hi')}

--- \url{https:://www.nytimes.com} --- $\backslash$
{[} [nytimes.com] [\url{https://www.nytimes.com}]]

links:
\href{281\_emacs\_notes.typ}{281\textsubscript{emacs}\textsubscript{cheat}}

\begin{quote}
Type <q <TAB> to insert quote block
\end{quote}
\section{{\bfseries\sffamily TODO} Learn Org mode\hfill{}\textsc{org:learn}}
\label{sec:orge80bbc8}

Goal: START organizing projects; NEXT TODO for each;  replacing paper.
Second step:  Org mode vs denote vs ?  
TODO: set org-agenda-files to collect ALL TODOs. 
{[} [org-mode ] [\url{https://www.youtube.com/watch?v=0-brF21ShRk\&list=PLknodeJt-I5GJmcd7ENakYf\_M0x9q50d1\&index=8}]] Galvin
\begin{itemize}
\item {[} [tutorial][\url{https://emacsclub.github.io/html/org\_tutorial.html}] ]
\item {[} [another tutorial][\url{https://orgmode.org/worg/org-tutorials/orgtutorial\_dto.html}] ]
\end{itemize}
\section{Learn Help Files}
\label{sec:org40106cd}
\section{elisp}
\label{sec:orgdff1e3d}
\subsection{{\bfseries\sffamily TODO} Prot's book\hfill{}\textsc{read}}
\label{sec:org504e4cb}
\subsection{{\bfseries\sffamily TODO} Chicago book\hfill{}\textsc{read}}
\label{sec:orgceafc02}
\section{Prot's text:*   repo: M-x Dired | M-x dired-do-info (over file: elispelem.info)}
\label{sec:org4668a66}

\section{Learn: Denote\hfill{}\textsc{emacs:learn}}
\label{sec:org4ef3f3f}
\section{Algebra, Math, Statistics}
\label{sec:orgd929fab}
\subsection{good, basic review geomrtry + transformations: \url{https://pages.mtu.edu/\~shene/COURSES/cs3621/NOTES/}\hfill{}\textsc{read}}
\label{sec:org2902157}

\subsection{Linear Maps \& Derivatives (\url{https://math-website.pages.dev/}, "CantorClosure:  \url{https://www.reddit.com/r/learnmath/comments/1pjl731/differential\_calculus\_through\_linear\_maps/})}
\label{sec:org7138f25}
\subsection{Read Shaina Race\hfill{}\textsc{read}}
\label{sec:orgd23870c}
\begin{itemize}
\item write simple Baysian example :statistics:
\item write ellipse transformation to cononical coordinates. :math:
\item Calculus:  polar coordnates (r, theta),  r can be negative! :math:
\item Ng videos:  unsurprised (find patterns) [\url{https://learn.deeplearning.ai/specializations/machine-learning/lesson/a7qh0/unsupervised-learning-part-2} {[}Andrwe Ng]
\end{itemize}
\section{Shiny}
\label{sec:orge5f2550}
TODO Examples:  UI/modules
TODO March '25 pharma
TODO Teal Gallery
\section{Git}
\label{sec:org0a439f2}
\subsection{{\bfseries\sffamily TODO} Git In Practice\hfill{}\textsc{read}}
\label{sec:org00cd6d1}
HEAD, change Branch, vs TIP
MERGE
SQUASH
\section{i3}
\label{sec:org808cb18}
\section{ML/AI/LLMs/\ldots{}}
\label{sec:orgd16cc23}
\subsection{{\bfseries\sffamily TODO} Mnielson [ [neural][ \url{http://neuralnetworksanddeeplearning.com/chap1.html}]]\hfill{}\textsc{read}}
\label{sec:org7a8f0d2}
\subsection{{\bfseries\sffamily TODO} Clark models\hfill{}\textsc{read}}
\label{sec:org9b3024c}
\subsection{Kim, S\ldots{}. \url{https://skim.math.msstate.edu/LectureNotes/Machine\_Learning\_Lecture.pdf} (python, looks educational!)\hfill{}\textsc{read}}
\label{sec:org77f0305}
\subsection{{\bfseries\sffamily TODO} Patterns Hardt \& Recht\hfill{}\textsc{read}}
\label{sec:org00f8949}
\section{Typst}
\label{sec:org59e0c85}

USE online typst editor to debug  :typst
Basic:  000\textsubscript{simple.typ} (learning curve to get symbols and format right).
Math:  done- simple matrix  notation
\section{R}
\label{sec:orgc483026}
\begin{itemize}
\item typst:  Ch 1,2 my Advanced R notes
\end{itemize}
\section{Next Phone}
\label{sec:org008c551}
\subsection{{\bfseries\sffamily TODO} Pixel 3a XT?\hfill{}\textsc{shopping}}
\label{sec:org12dff79}
\section{Legacy Code}
\label{sec:org681c793}
\section{pyTorch}
\label{sec:orgce504bc}
\subsection{\url{https://www.learnpytorch.io/02\_pytorch\_classification/}\hfill{}\textsc{read}}
\label{sec:org66241cb}



\begin{center}
hi
\end{center}


\textit{<2024-05-04 Sat>}:

\#\# REST RESTful, HTTP Protocol , JSON, RFC, API and Web Technologies

\begin{verbatim}
git status
\end{verbatim}
\subsection{Kim, S. Math Foundations \url{https://skim.math.msstate.edu/LectureNotes/Machine\_Learning\_Lecture.pdf}\hfill{}\textsc{read}}
\label{sec:org767b978}
\subsection{Mohamed AAZI - good, but lost the lin\hfill{}\textsc{read}}
\label{sec:org3f290b2}
\subsection{ML from scratch, python, plus details:  \url{https://github.com/rodmarkun/SmolML?tab=readme-ov-file}\hfill{}\textsc{read}}
\label{sec:org7ac23fe}
\subsection{video:  freeCodeCamp pyTorch\hfill{}\textsc{read}}
\label{sec:orgcbe01cc}
\subsection{Geeks4Geeks : scikit\hfill{}\textsc{read}}
\label{sec:orgb38106e}
\end{document}
